<?php

namespace App\Services;

class RandomMessage
{

    private static array $birthdayMessages = [
        "زادروزت فرخنده! امیدوارم روزی سرشار از شادی و سالی پر از لذت داشته باشی.\n",
        "تولدت مبارک! امیدوارم این روز به اندازه‌ی خودت خاص و دوست‌داشتنی باشه.\n",
        "یک سال ماجراجویی دیگه در انتظارته! برات تولدی شاد و پر از هیجان آرزو می‌کنم.\n",
        "امیدوارم تمام شادی‌هایی که به دیگران هدیه دادی، امروز به خودت برگرده. تولدت مبارک!\n",
        "وای، امروز روز بزرگیه، تولدته! تولدت مبارک! مبارک باشه!\n",
        "امروز یک روز خاصه و ما می‌خوایم مطمئن بشیم که ازش نهایت لذت رو می‌بری. تولدت مبارک!\n",
        "امیدوارم روز تولدت و تمام روزهای زندگیت پر از لبخند، خنده و عشق باشه.\n",
        "برات روزی آرزو می‌کنم که از هر نظر به اندازه‌ی خودت خاص باشه. زادروزت مبارک!\n",
        "تو هدیه‌ای برای این دنیا هستی. تولدت مبارک!\n",
        "امروز تولدت رو جشن بگیر و هر روز شاد بودنت رو. مبارک باشه!\n",
        "امیدوارم امسال بهترین سال زندگیت باشه. برات دلی پر از خوشبختی آرزو می‌کنم. تولدت مبارک!\n",
        "امیدوارم تولدت پر از ساعت‌های شاد و زندگیت پر از تولدهای مبارک باشه. تولدت مبارک!\n",
        "تو زندگی رو برای همه‌ی اطرافیانت شادتر می‌کنی. تولدت مبارک!\n",
        "برایت روزی به خاصی خودت آرزومندم. تولدت مبارک!\n",
        "با رویاهات دنیا رو به آتش بکش و از شعله‌اش شمع تولدت رو روشن کن. تولدت مبارک!\n",
        "امیدوارم تولدت سرآغازی برای سالی پر از خوش‌شانسی، سلامتی و شادی باشه. تولدت مبارک!\n",
        "تولد فوق‌العاده‌ای داشته باشی. آرزو می‌کنم هر روزت پر از عشق، خنده، شادی و گرمای خورشید باشه.\n",
        "امیدوارم زادروزت، شروع دوره‌ای شگفت‌انگیز در زندگیت باشه! تولدت مبارک!\n",
        "امیدوارم تولدت لبریز از ساعت‌های خوش و زندگیت سرشار از تولدهای فرخنده باشه. تولدت مبارک!\n",
        "برات تولدی پر از شادی و لحظه‌های فراموش‌نشدنی آرزو می‌کنم!\n",
        "امیدوارم روز خاص تو، مثل لبخندت روشن و شاد باشه. تولدت مبارک!\n",
        "یک دنیا عشق و بهترین آرزوها برای سال پیش روت. تولدت مبارک!\n",
        "یک سال بزرگ‌تر، داناتر و حتی شگفت‌انگیزتر. تولدت مبارک!\n",
        "امیدوارم قلبت پر از رویا، زندگیت پر از عشق و روزت پر از شادی باشه. تولدت مبارک!\n",
        "آرزو می‌کنم در این روز خاص، تمام آرزوهات برآورده بشه. تولدت مبارک!\n",
        "هر روز یک هدیه‌ است، اما امروز یه هدیه‌ی ویژه‌ست. تولدت مبارک!\n",
        "امیدوارم تولدت سرشار از آفتاب، خنده و دوستان خوب باشه!\n",
        "یک سال بزرگ‌تر، یک سال بهتر! برات بهترین تولد رو آرزو می‌کنم!\n",
        "امیدوارم تولدت شروع سالی پر از ماجراهای جدید و خاطرات شاد باشه!\n",
        "تو لایق شادترین تولد دنیایی! در این روز خاص بهترین‌ها رو برات آرزو می‌کنم!\n",
        "به سلامتی یک سال فوق‌العاده‌ی دیگه! تولدت مبارک!\n",
        "امیدوارم تولدت شروع سالی پر از سلامتی، خوشبختی و روزهای خوب باشه!\n",
        "تو فوق‌العاده‌ترین کسی هستی که می‌شناسم. تولدت مبارک!\n",
        "برات تولدی به بی‌نظیری خودت آرزو می‌کنم!\n",
    ];

    private static array $anniversaryMessages = [
        "همکار عزیز، سالگرد همکاری‌مون رو تبریک می‌گم!\n",
        "سالگرد همکاری‌تون مبارک باشه!\n",
        "به امید یک سال موفقیت‌آمیز دیگه!\n",
        "سالگرد همکاری‌تون رو تبریک می‌گم! شما الهام‌بخش همه‌ی ما هستید!\n",
        "سالگرد همکاری‌تون مبارک! تلاش‌ها و مشارکت شما در تیم و شرکت بی‌نهایت ارزشمنده.\n",
        "تبریکات صمیمانه‌ام رو به مناسبت سالگرد همکاری‌تون پذیرا باشید. شما یک سرمایه‌ی ارزشمند برای تیم و شرکت هستید.\n",
        "سالگرد همکاری‌تون مبارک! تعهد و سخت‌کوشی شما به ما کمک کرده تا به دستاوردهای بزرگی برسیم.\n",
        "تبریک بابت سالگرد همکاری‌تون! شما بخش مهمی از تیم و شرکت ما هستید.\n",
        "سالگرد همکاری‌تون مبارک! تعهد و تلاش شما به رشد و موفقیت ما کمک کرده.\n",
        "سالگرد همکاری‌تون رو تبریک می‌گم! شما عضو ارزشمندی برای تیم و شرکت ما هستید.\n",
        "سالگرد همکاری‌تون مبارک! تعهد شما به عالی بودن واقعاً ستودنیه.\n",
        "سالروز همکاری‌تون مبارک! تعهد و اشتیاق شما همیشه الهام‌بخش ماست.\n",
        "به امید یک سال دیگر سرشار از موفقیت و دستاورد!\n",
        "سالگرد همکاری‌تون مبارک! همکاری و روحیه‌ی تیمی شما در موفقیت‌های ما نقش اساسی داشته.\n",
        "سالروز همکاری‌تون مبارک! سخت‌کوشی و پشتکار شما ما را به جایگاه‌های جدیدی رسونده.\n",
        "سالگرد همکاری‌تون رو تبریک می‌گم! مشارکت‌های شما تفاوت بزرگی در مسیر شرکت ایجاد کرده.\n",
        "سالگرد همکاری‌تون مبارک! تعهد شما به کیفیت، پایه‌ی موفقیت ماست.\n",
        "تبریکات صمیمانه بابت سالگرد همکاری! ما قدردان تعهد و تمام دستاوردهای شما هستیم.\n"
    ];


    public static function getHeader($name)
    {
        return "PERSOL HRMS\nFROM: {$name}\n\n";
    }

    public static function getFooter()
    {
        return "\n لغو 11";
    }

    public static function getBDayMessage()
    {
        return self::getHeader(auth()->user()->fullName) . self::$birthdayMessages[array_rand(self::$birthdayMessages)] . self::getFooter();
    }

    public static function getAnniversaryMessage()
    {
        return self::getHeader(auth()->user()->fullName) . self::$anniversaryMessages[array_rand(self::$anniversaryMessages)] . self::getFooter();
    }

    public static function getCustomizedMessage($message)
    {
        return self::getHeader(auth()->user()->fullName) . $message . "\n" . self::getFooter();
    }
}
